### Class practice on 04/06/2024 - Advanced python programming
##### Prajwal Luitel (C0927658)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

## Lecture 4
#### Python for data transformation

In [2]:
titanic_df = pd.read_csv("./titanic.csv")
titanic_df.head()

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,2673.0,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,348125.0,7.13,0.0,0.0,yes

In [4]:
titanic_df.shape

(2207, 11)

In [5]:
titanic_df.isnull().mean()

name        0.000000
gender      0.000000
age         0.000906
class       0.000000
embarked    0.000000
country     0.036701
ticketno    0.403715
fare        0.415043
sibsp       0.407793
parch       0.407793
survived    0.000000
dtype: float64

In [7]:
titanic_df.describe()

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
25%      22.000000  1.426225e+04     7.180600     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
75%      38.000000  3.470770e+05    31.060750     1.000000     0.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [8]:
titanic_df.describe(percentiles = [0.01,.1,.2,.3,.5,.6,.7,.8,.9,.99])

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
1%        2.000000  7.668500e+02     6.150000     0.000000     0.000000
10%      18.000000  2.668000e+03     7.140800     0.000000     0.000000
20%      21.000000  1.166800e+04     7.170600     0.000000     0.000000
30%      24.000000  1.758100e+04     8.010000     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
60%      32.000000  2.376680e+05    22.070200     0.000000     0.000000
70%      36.000000  3.309755e+05    27.140500     1.000000     0.000000
80%      40.000000  3.492170e+05    42.080000     1.000000     1.000000
90%      46.000000  3.686375e+05    78.050400     1.000000     2.000000
99%      63.000000  3.101304e+06   262.070600     5.000000     4.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [9]:
titanic_df['age'].quantile(0.01)

2.0

In [10]:
titanic_df.drop('ticketno', axis=1).head(1)

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no

In [11]:
del titanic_df['ticketno']

titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

### Navigating through a dataframe

In [12]:
titanic_df.at[0,'age']

42.0

In [14]:
titanic_df.at[0,'age'] = 52

titanic_df.at[0,'age']

52.0

In [15]:
titanic_df.at[0,'age']

52.0

In [13]:
# get index name
titanic_df.index.name

In [16]:
titanic_df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [17]:
titanic_df.loc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

#### Setting the index

In [18]:
titanic_df.set_index(titanic_df['name'], inplace=True)
titanic_df.index.name

'name'

In [19]:
titanic_df.loc['Abbott, Mr. Eugene Joseph']

name        Abbott, Mr. Eugene Joseph
gender                           male
age                              13.0
class                             3rd
embarked                            S
country                 United States
fare                            20.05
sibsp                             0.0
parch                             2.0
survived                           no
Name: Abbott, Mr. Eugene Joseph, dtype: object

In [20]:
# doesn't work as index is not a number
titanic_df.iloc['Abbott, Mr. Eugene Joseph']

TypeError: Cannot index by location index with a non-integer key

In [21]:
titanic_df.loc[1:4]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [22]:
titanic_df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
name,,,,,,,,,,
"Abbott, Mr. Eugene Joseph","Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
"Abbott, Mr. Rossmore Edward","Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
"Abbott, Mrs. Rhoda Mary 'Rosa'","Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [23]:
titanic_df.reset_index(drop=True, inplace=True)
titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

#### Selecting rows based on conditions

In [24]:
titanic_df[titanic_df['gender']=='female'].shape

(489, 10)

In [25]:
# create a sub table
female_df = titanic_df[titanic_df['gender']=='female']
female_df.shape

(489, 10)

In [27]:
# Create a sub-table with multiple conditions using logical and
female_more_than_fifty = titanic_df.query("gender=='female' and age > 50 ")
female_more_than_fifty.shape

(36, 10)

In [28]:
# Creating sub table with multiple conditions using logical or
female_or_more_than_fifty = titanic_df.query("gender == 'female' or age >50")
female_or_more_than_fifty.shape

(586, 10)

In [30]:
# Creating sub table with multiple conditions using logical or and logical and
female_greater_fifty_male_less_twenty = titanic_df.query(f"(gender =='female' and age>50) or (gender=='male' and age<20) ")
female_greater_fifty_male_less_twenty.shape

(244, 10)

#### Adjusting dataframe

In [31]:
titanic_df['gender'].replace(['female','male'], ['W','M']).head(5)

0    M
1    M
2    M
3    W
4    W
Name: gender, dtype: object

In [32]:
# creting new column
titanic_df['sex'] = titanic_df['gender'].replace(['female', 'male'],[1,0])
titanic_df['sex'].value_counts()

sex
0    1718
1     489
Name: count, dtype: int64

In [33]:
titanic_df['gender'].value_counts(dropna=False)

gender
male      1718
female     489
Name: count, dtype: int64

In [34]:
titanic_df['survived_ind'] = titanic_df['survived'].replace(['yes', 'no'], [1,0])
titanic_df.survived_ind.value_counts(dropna=False)

survived_ind
0    1496
1     711
Name: count, dtype: int64

In [35]:
titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no,0,0
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no,0,0
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no,0,0
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes,1,1
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes,1,1